# IsPerspective Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CameraInfo..::..IsPerspective Property
CameraInfo Class See Also
---
Identifies whether the projection is orthographic or perspective
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsPerspective { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsPerspective As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsPerspective {
	bool get ();
}
```

# See Also
CameraInfo Class
Autodesk.Revit.DB Namespace